{
  "sets": {
    "-an": "Anrenee's apartment, outside area with a buzzer and inside area with mailroom and then a lobby hallway that we go up a flight of stairs to her apartment.  Inside is the bedroom and bathroom and living area and kitchen.",
    "-en": "Cosmos - the name of our college house we lived in",
    "-ong": "Bellevue Gym (The nice gym in philly with a lobby and smoothie bar and lots of classes and a workout room and a pool area with a hot tub and sauna)",
    "-e": "Eric's place in Maine (beautiful house in Bath Maine, decent sized yard with a blackstone grill and cold in the winter with a fireplace)",
    "-ou": "Current Philly house with roommates (in center city philly)",
    "-a": "Scottsdale coworking space in Arizona (tone 2 use coffee shop, tone 3 use actual office, tone 4 use parking lot,)",
    "-ao": "15 ft travel trailer (currently parked in a warehouse in Philly, toured across US/Canada to Las Vegas and Nova Scotia)",
    "-ei": "High school",
    "-o": "Iowa - Jean's house (Jean was into funny jesus things so there were random jesus pictures and bobbleheads around the house.  Two dogs, a backyard with a broken airstream in it that Jean wanted to fix up.  A larger nicer bathroom on the ground floor.)",
    "-ang": "Rish's apartment in New Delhi (a large apartment with a balcony where he would do woodworking and leathworking, a studio where my air mattress was, a bathroom with a shower and bidet and bucket, and a closed kitchen area and a living room with two small cats and a record player.  Occasionally Rish's girlfriend would be giving tattoos in the open area)",
    "null": "Bridgewater home (the home I grew up in, my parents home in new jersey)"
  },
  "tones": {
    "1": "Outside the entrance",
    "2": "Kitchen or inside entrance",
    "3": "Bedroom or living room",
    "4": "Bathroom or outside/yard",
    "5": "On the roof"
  },
  "actors": [
    {
      "initial": "b",
      "name": "Bill Murray",
      "type": "male"
    },
    {
      "initial": "ch",
      "name": "Charlie Sheen",
      "type": "male"
    },
    {
      "initial": "r",
      "name": "The Rock",
      "type": "male"
    },
    {
      "initial": "g",
      "name": "Gordon Ramsay",
      "type": "male"
    },
    {
      "initial": "k",
      "name": "Kim Jong Un",
      "type": "male"
    },
    {
      "initial": "c",
      "name": "Christopher Walken",
      "type": "male"
    },
    {
      "initial": "s",
      "name": "Snoop Dogg",
      "type": "male"
    },
    {
      "initial": "f",
      "name": "Freddy Mercury",
      "type": "male"
    },
    {
      "initial": "zh",
      "name": "Jim Carrey",
      "type": "male"
    },
    {
      "initial": "ø",
      "name": "Jackie Chan",
      "type": "male"
    },
    {
      "initial": "sh",
      "name": "Shaq",
      "type": "male"
    },
    {
      "initial": "m",
      "name": "Michael Jackson",
      "type": "male"
    },
    {
      "initial": "xi",
      "name": "Shakira",
      "type": "female"
    },
    {
      "initial": "ni",
      "name": "Nicole Oringer",
      "type": "female"
    },
    {
      "initial": "ji",
      "name": "Jamie (your sister)",
      "type": "female"
    },
    {
      "initial": "yi",
      "name": "Yoa (Born in Paris to a Swiss father and Cameroonian mother, YOA is a singer, songwriter and musician who has emerged as one of France’s most exciting pop talents. Her exquisite voice and cinematic songwriting are evident throughout her discography, from her 2021 debut EP ‘Attente’ to her more recent EPs ‘Chansons (+) tristes’ (2022) and ‘Nulle’ (2024), both of which showcase her penchant for witty pop arrangements and soaring vocals)",
      "type": "female"
    },
    {
      "initial": "qi",
      "name": "Aria Trueblood (the yoga instructor at the gym.  She is chosen because 'chi' as energy relates to 'qi' the sound.  Aria starts her yoga class with a brief intro where she usually rambles a bit about being in touch with your emotions and it's a very safe space, she mentions therapy and if you're not having the best day she says thats okay.  Then she usually starts the routine which occasionally will include harder poses like a handstand or crow.)",
      "type": "female"
    },
    {
      "initial": "ru",
      "name": "Ron Weasley",
      "type": "fictional"
    },
    {
      "initial": "du",
      "name": "Darth Vader",
      "type": "fictional"
    },
    {
      "initial": "wu",
      "name": "Woody",
      "type": "fictional"
    },
    {
      "initial": "shu",
      "name": "Shrek",
      "type": "fictional"
    },
    {
      "initial": "ku",
      "name": "Mr. Krabs",
      "type": "fictional"
    }
  ],
  "radicalProps": [
    {
      "radical": "一",
      "prop": "Razorblade"
    },
    {
      "radical": "二",
      "prop": "Twins"
    },
    {
      "radical": "丨",
      "prop": "Gandalf staff"
    },
    {
      "radical": "十",
      "prop": "Cross"
    },
    {
      "radical": "丷",
      "prop": "devil's horns (like on top of 兄 in 兑）"
    },
    {
      "radical": "半"
    },
    {
      "radical": "八",
      "prop": "Magic 8 Ball"
    },
    {
      "radical": "人",
      "prop": "Person doing a split"
    },
    {
      "radical": "亻",
      "prop": "Mr. T (variant of 人)"
    },
    {
      "radical": "从",
      "prop": "Two people"
    },
    {
      "radical": "𠂉",
      "prop": "Uncle Jeff (loser)"
    },
    {
      "radical": "午",
      "prop": "Sundial"
    },
    {
      "radical": "𠃍",
      "prop": "Horse Head"
    },
    {
      "radical": "口",
      "prop": "Rolling Stones mouth"
    },
    {
      "radical": "中",
      "prop": "Chinese scepter"
    },
    {
      "radical": "乚",
      "prop": "Hook"
    },
    {
      "radical": "儿",
      "prop": "Patrick Star's big black boots"
    },
    {
      "radical": "只",
      "prop": "Lone droid"
    },
    {
      "radical": "兄",
      "prop": "Older brother Eric"
    },
    {
      "radical": "兑",
      "prop": "deal with the devil/wad of cash"
    },
    {
      "radical": "讠",
      "prop": "microphone"
    },
    {
      "radical": "㇉",
      "prop": "toilet"
    },
    {
      "radical": "马",
      "prop": "Horse"
    },
    {
      "radical": "乙",
      "prop": "Swan"
    },
    {
      "radical": "乞",
      "prop": "A beggar"
    },
    {
      "radical": "冫",
      "prop": "icicle"
    },
    {
      "radical": "气"
    },
    {
      "radical": "又"
    },
    {
      "radical": "日"
    },
    {
      "radical": "旦"
    },
    {
      "radical": "早"
    }
  ],
  "characters": [
    {
      "character": "一",
      "pinyin": "yī",
      "definition": "One"
    },
    {
      "character": "二",
      "pinyin": "èr",
      "definition": "Two"
    },
    {
      "character": "三",
      "pinyin": "sān",
      "definition": "Three"
    },
    {
      "character": "十",
      "pinyin": "shí",
      "definition": "Ten"
    },
    {
      "character": "干",
      "pinyin": "gān",
      "definition": "Dry"
    },
    {
      "character": "半",
      "pinyin": "bàn",
      "definition": "Half"
    },
    {
      "character": "人",
      "pinyin": "rén",
      "definition": "Person"
    },
    {
      "character": "从",
      "pinyin": "cóng",
      "definition": "Follow"
    },
    {
      "character": "个",
      "pinyin": "gè",
      "definition": "Individual"
    },
    {
      "character": "入",
      "pinyin": "rù",
      "definition": "Enter"
    },
    {
      "character": "什",
      "pinyin": "shén",
      "definition": "What"
    },
    {
      "character": "午",
      "pinyin": "wǔ",
      "definition": "Noon"
    },
    {
      "character": "年",
      "pinyin": "nián",
      "definition": "Year"
    },
    {
      "character": "口",
      "pinyin": "kǒu",
      "definition": "Mouth"
    },
    {
      "character": "中",
      "pinyin": "zhōng",
      "definition": "Center"
    },
    {
      "character": "叫",
      "pinyin": "jiào",
      "definition": "Call"
    },
    {
      "character": "八",
      "pinyin": "bā",
      "definition": "Eight"
    },
    {
      "character": "只",
      "pinyin": "zhǐ",
      "definition": "Only"
    },
    {
      "character": "介",
      "pinyin": "jiè",
      "definition": "Introduction"
    },
    {
      "character": "儿",
      "pinyin": "ér",
      "definition": "Child/Kid"
    },
    {
      "character": "四",
      "pinyin": "sì",
      "definition": "Four"
    },
    {
      "character": "兄",
      "pinyin": "xiōng",
      "definition": "Elder brother"
    },
    {
      "character": "兑",
      "pinyin": "duì",
      "definition": "Exchange"
    },
    {
      "character": "说",
      "pinyin": "shuō",
      "definition": "Speak"
    },
    {
      "character": "计",
      "pinyin": "jì",
      "definition": "Plan",
      "imgUrl": "assets/images/ji4.webp",
      "movie": "Jamie is pacing inside the Bridgewater bathroom, deep in thought.\nShe holds a microphone (讠), speaking softly to herself like she's dictating her next brilliant idea.\nBut taped to the wall in front of her is a big red Cross (十) — like a target or goal.\nShe stares at it, clicks her pen, and says into the mic:\n“Phase one: wake up early. Phase two: coffee. Phase three: world domination.”\nThe mic glows each time she speaks a bullet point. The cross lights up every time a new step in the plan is added — like a checklist being burned into reality.\nJust as she says “step ten,” the bathroom lights flicker like a conspiracy board is about to explode.Phase one: wake up early. Phase two: coffee. Phase three: world domination.\nThe mic glows each time she speaks a bullet point. The cross lights up every time a new step in the plan is added — like a checklist being burned into reality."
    },
    {
      "character": "认",
      "pinyin": "rèn",
      "definition": "Recognize",
      "imgUrl": "assets/images/ren4.jpg"
    },
    {
      "character": "识",
      "pinyin": "shí",
      "definition": "Knowledge",
      "radicals": [
        "讠",
        "只"
      ]
    },
    {
      "character": "马",
      "pinyin": "mǎ",
      "definition": "Horse",
      "radicals": [
        "𠃍",
        "一",
        "㇉"
      ]
    },
    {
      "character": "吗",
      "pinyin": "ma",
      "definition": "Question Mark (yes/no)",
      "radicals": [
        "口",
        "马"
      ]
    },
    {
      "character": "骂",
      "pinyin": "mà",
      "definition": "Scold",
      "radicals": [
        "口",
        "口",
        "马"
      ],
      "imgUrl": "assets/images/ma4.jpg",
      "movie": "In Jean's house in Iowa, amidst an eclectic mix of Jesus pictures and bobbleheads, Michael Jackson is attempting to moonwalk with the two resident dogs in the backyard, right next to the broken airstream. However, every time he tries to slide gracefully, he ends up stepping on a misplaced bobblehead of Jesus, causing him to trip and softly scold the bobbleheads with a \"Hee-hee\" and a playful wag of his finger, saying, \"You've been hit by, you've been struck by, a smooth criminal.\"\n\nThis unexpected scene is watched from the large, nicer bathroom window by the dogs, who seem to be judging Michael's moonwalking skills, leading Michael to playfully '骂' (mà), or scold, them in a light, humorous tone for their silent judgment. \n\nHere, in the Tone 4 location of Jean's backyard, Michael's playful scolding amidst the religious and quirky decor, under the watchful eyes of bobbleheads and dogs, creates a memorable tableau that vividly encapsulates the meaning of '骂' (mà) - to scold or berate, all while keeping a light and humorous air."
    },
    {
      "character": "乙",
      "pinyin": "yǐ",
      "definition": "Second",
      "radicals": [
        "一",
        "乚"
      ],
      "movie": "At the heart of your childhood home in Bridgewater, Yoa stands in the cozy, yet slightly cluttered living room, a space imbued with nostalgia. In her quest to find a second career as a magician, she's hilariously attempting to use a razorblade (一) to slice through the air, aiming to magically produce music notes. \n\nBut with a swift, comedic slip of her hand, she instead hooks (乚) onto the family’s antique, slightly off-tune piano, causing a single, resonant note to echo through the room, marking her second failed attempt at magic, yet somehow filling the space with her signature, soaring vocals by accident. \n\nThis scene of Yoa, amidst laughter and music, engraves the character 乙 (yǐ), meaning \"second\", in your memory, symbolized by her second, unintended musical triumph in the comfort of your childhood home."
    },
    {
      "character": "乞",
      "pinyin": "qǐ",
      "definition": "Beg",
      "imgUrl": "assets/images/qi3.webp",
      "radicals": [
        "乙",
        "𠂉"
      ],
      "movie": "In the serene living room of my childhood home in Bridgewater, Aria Trueblood is attempting to teach Uncle Jeff, the family's acknowledged loser, a particularly difficult yoga pose. As she gracefully balances in a handstand, trying to inspire Uncle Jeff, a swan waddles in, somehow embodying more grace than Jeff could ever hope to muster.\n\nAria, never missing a beat, transitions into a therapeutic speech about acceptance and reaching out for help when needed, directly addressing the swan as if it's a part of the class. Uncle Jeff, now sitting on the floor looking defeated, extends his arms towards the swan in a gesture that screams \"I beg for the grace and balance you possess,\" creating a perfect tableau of the word \"乞\" - to beg, with Aria's teachings echoing as a backdrop."
    },
    {
      "character": "吃",
      "pinyin": "chī",
      "definition": "Eat",
      "imgUrl": "assets/images/chi1.jpg",
      "radicals": [
        "口",
        "乞"
      ],
      "movie": "Outside the entrance of your childhood home in Bridgewater, Charlie Sheen is engaged in a peculiar standoff. In one hand, he holds a giant, inflatable version of the Rolling Stones mouth, symbolizing the radical \"口,\" and in the other, he extends a slice of pizza towards a cardboard cutout of a beggar, representing the \"乞\" radical. \n\nHe theatrically declares, \"To eat or not to eat, that is the question!\" before taking a huge bite out of the pizza, the beggar cutout seemingly looking on in envy. This humorous scene, with Charlie's exaggerated antics and the iconic backdrop of your home, embeds the character \"吃\" (chī) - \"Eat\" into your memory through the visuals of eating and the included radicals."
    },
    {
      "character": "气",
      "pinyin": "qì",
      "imgUrl": "assets/images/qi4.webp",
      "definition": "Air",
      "radicals": [
        "𠂉",
        "乙",
        "一"
      ],
      "movie": "In the serene yard of your childhood home in Bridgewater, Aria Trueblood is seen attempting to teach your Uncle Jeff, the infamous loser, how to channel his inner \"qi\" or air through yoga. Despite the peaceful setting, Aria balances precariously on one foot, mimicking a swan's grace, while Uncle Jeff flails about, knocking over a razorblade that had been inexplicably left on the garden table, symbolizing the character's first stroke.\n\nIn the midst of this chaos, Aria, ever the optimist, elevates her voice to remind everyone that it's okay to be a bit \"off\" today, her words floating through the air like a soothing breeze. This peculiar scene, with Aria's patience rivaling that of a saint and Uncle Jeff's antics, ensures you'll never forget \"气\" represents \"air,\" with the swan's elegance and the razor's precision mirroring its radical components."
    },
    {
      "character": "飞",
      "pinyin": "fēi",
      "imgUrl": "assets/images/fei1.jpg",
      "definition": "Fly",
      "radicals": [
        "乙",
        "冫"
      ],
      "movie": "Outside the high school entrance, Freddy Mercury, wearing his iconic outfit, is preparing for an extraordinary performance. With a swan gracefully perched on his shoulder, he strums his guitar made of icicles, enchanting the swan to start flapping its wings. \n\nAs the melody reaches its crescendo, both Freddy and the swan begin to lift off the ground, defying gravity - they're flying! The sight of rock legend Freddy Mercury levitating with a swan outside a high school, all thanks to his icy guitar, makes \"飞\" (fēi) - \"Fly\" unforgettable."
    },
    {
      "character": "况",
      "pinyin": "kuàng",
      "imgUrl": "assets/images/kuang4.jpg",
      "definition": "Situation",
      "radicals": [
        "冫",
        "兄"
      ],
      "movie": "In the bustling bathroom of Rish's New Delhi apartment, Mr. Krabs finds himself in a slippery situation. While attempting to navigate the icy floor, caused by an enormous icicle (冫) that somehow found its way indoors during a freak weather phenomenon, he calls out for help. His older brother Eric (兄), who was in the middle of giving a tattoo in the living area, rushes in with a bucket of warm water to melt the chaos-creating ice. This odd rescue scenario, happening against a backdrop of a bathroom where modern fixtures meet traditional methods, perfectly encapsulates the \"situation\" (况) they find themselves in, with Mr. Krabs humorously slipping and sliding every time he attempts to articulate his gratitude."
    },
    {
      "character": "日",
      "pinyin": "rì",
      "definition": "Day",
      "radicals": [
        "口",
        "一"
      ],
      "movie": "In the yard of your childhood Bridgewater home, The Rock is hosting the most electrifying barbecue the neighborhood has ever seen. To kick off the day, he uses a massive, shining razorblade (一) to expertly slice veggies and meats. However, he's momentarily distracted by the iconic Rolling Stones mouth (口) decoration hanging above the grill, which comically starts singing \"Start Me Up\" as the sun (日) rises, casting a spotlight on him. Chuckling, The Rock quips, \"Looks like it's my day to shine,\" as he flips burgers with the precision of a superstar, making the whole scene an unforgettable daylight spectacle."
    },
    {
      "character": "旧"
    },
    {
      "character": "旦"
    },
    {
      "character": "但"
    },
    {
      "character": "早"
    },
    {
      "character": "唱"
    },
    {
      "character": "电"
    },
    {
      "character": "七"
    },
    {
      "character": "化"
    },
    {
      "character": "白"
    },
    {
      "character": "百"
    },
    {
      "character": "今"
    },
    {
      "character": "千"
    },
    {
      "character": "舌"
    },
    {
      "character": "话"
    },
    {
      "character": "活"
    },
    {
      "character": "乱"
    },
    {
      "character": "汽"
    },
    {
      "character": "月"
    },
    {
      "character": "用"
    },
    {
      "character": "胖"
    },
    {
      "character": "朋"
    },
    {
      "character": "明"
    }
  ]
}